{
  "FSE": {
    "Mathematics": [],
    "Applied Mathematics": [],
    "Applied Mechanics and Aerospace Engineering": [],
    "Electronic and Physical Systems": [
      {
        "lab": "Takashi Tanii",
        "reviews": [
          {
            "t": "2021/03/20 16:54:06",
            "theme": "There are two research teams:  \n1)  Develop quantum NMR sensors.  That is, sensors that use quantum mechanical structures (like electrons trapped in diamond nitrogen vacancy centers) to measure extremely small magnetic fields.\n\n 2) Develop biological computer.  That is, a computer made from living cells instead of silicon chips.",
            "coreTime": "None, I go for a couple hours a week",
            "obligations": "Weekly seminar on selected topics.  Do your part in the research, write final research paper and give presentation.  That's it.",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "My project is not really a \"thesis\" as much as it is an engineering activity.  I have been tasked with simply programming an FPGA using Verilog HDL to gather photon intensity data from an avalanche photodiode.  The code will be used as part of the larger research project, which is to make quantum NMR sensors.  When I am done, I simply need to write a document explaining the code, which will be published on the lab website so others can develop the same system.",
            "topicSatisfication": 4,
            "atmosphere": "Very relaxed.  It's a small lab and I'm the only international student, but we get short-term exchange students from time to time.  We work individually, but everyone is really helpful and the professor (Tanii) is really active in helping out.  He will basically teach you anything you want to know.  Also, mostly everyone will speak English with you, so that's nice.",
            "guidance": 3,
            "profCharacter": "Professor Tanii is a nice guy, but he is a little all over the place.  He will gladly help you with whatever you want, speaks good English and maintains a good sense of humor.  However, he does a lot of things and will easily forget anything that has been discussed, including any work he has assigned, so don't be surprised if he doesn't follow up on a deadline.",
            "internationalStudents": "Bachelor (1)",
            "jaRequired": "Not at all!  Even though I'm the only international student, everyone speaks English when I'm around.  Still, it's good to know Japanese because sometimes they struggle to explain things in English.",
            "happiness": 5,
            "knowBeforeEnter": "1)  This lab does not have an active internship/company recruitment program like other labs do, so, as Tanii said to me, \"You're on your own for job hunting\".\n2)  The work style of this lab is extremely unstructured.  That is, you can do whatever you want, schedule meetings whenever you want, submit assignments whenever you want.  This is partly good, because it keeps your schedule flexible, but it's also a problem if you need some pressure or structure to get your work done.  It is very easy to leave everything to the last minute in this lab.\n3)  It is really helpful if you come to this lab with strong knowledge of electronic circuits, semiconductors, programming FPGA's or anything else that you know you will use in this lab.  We are very hands-on, that is, we build everything we need (Tanii does not buy equipment!).  Tanii will teach you the stuff if you want, but you will work much more efficiently and have much more fun if you come with the prerequisites so you can start coding and soldering immediately! :)\n4)  On a similar note, this lab is not \"research\" (theory) oriented.  We are an experimental lab, that is, we do hands-on experiments.  If you like engineering and building things, this is the lab for you.  If you like scientific research and coming up with new theories, you won't like this lab so much.",
            "totalStudents": "I don't really know, but I think we may have around 15 students total",
            "enRequired": ""
          }
        ]
      }
    ],
    "Computer Science and Engineering": [
      {
        "lab": "Wataru Kameyama",
        "reviews": [
          {
            "t": "2020/10/22 14:39:19",
            "theme": "The lab focuses on Multimedia Distribution Systems, so audio/video codecs and streaming, Quality of Experience evaluations using bio-signals, and using a semantic segmentation AI to identify and tag items in various media with metadata.",
            "coreTime": "Wednesdays 5th and 6th periods.",
            "obligations": "Weekly meetings, monthly presentations and progress reports.",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Quality of Experience evaluation of streaming service quality presets on Spotify using electroencephalography and heart rate.",
            "topicSatisfication": 4,
            "atmosphere": "The lab is headed by Kameyama-sensei but his assistant professor Suganuma-sensei is there to assist in the cognitive psychology aspect of some of these surveys that involve fields other than his speciality. The students are generally friendly and willing to assist in setting up equipment and conducting the experiment.",
            "guidance": 4,
            "profCharacter": "The professor is somewhat firm but fair, and is quite easy to talk to. He has been very helpful in pointing me in the right direction with my thesis.",
            "internationalStudents": "Bachelor (4), Masters (3), Ph. D (1)",
            "jaRequired": "The lab allows you to present completely in English, and the professors and other Masters students also know a decent amount of English, so there isn't a problem with the language.",
            "happiness": 5,
            "knowBeforeEnter": "Don't enter this lab if you're not interested in media or how multimedia systems are run because it is hard to find a topic to commit yourself to, and once you get assigned a topic, it becomes a challenge to find something that hasn't been done before.",
            "totalStudents": "Bachelor (8), Masters (10), Ph.D. (4)",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Simo-Serra Edgar",
        "reviews": [
          {
            "t": "2021/03/20 15:57:24",
            "theme": "Computer vision related deep learning, and video game related reinforcement Learning",
            "coreTime": "None",
            "obligations": "weekly progress report, term reports",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "I'm trying to develop a Pokemon game bot with reinforcement learning. Game bots with RL has been a popular thing since AlphaGO from 2016. Since AlphaGO, researcher has switched interests into more complex modern video games like Dota 2 and Starcraft. (Look up OpenAI Five and AlphaStar) The importance of RL game bot research is that, given how complex these games are, an competent agent in these games must be highly general and can be applied to other fields too.",
            "topicSatisfication": 4,
            "atmosphere": "Since covid nobody has been coming to the lab and most people havent seen each other irl",
            "guidance": 2,
            "profCharacter": "Chill guy but busy guy. Usually would do things for us if we ask but have to schedule much ahead of time",
            "internationalStudents": "3 myself included",
            "jaRequired": "the prof is fluent in many language so you can get away with just English, but you won't make any friends if you dont speak Japanese.",
            "happiness": 4,
            "knowBeforeEnter": "Learn Python, Learn how to use Linux, get used to finding code on github",
            "totalStudents": "forgot, like around 15 - 20 in total",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Toshiharu Sugawara",
        "reviews": [
          {
            "t": "2021/03/20 16:18:18",
            "theme": "Multi-agent system",
            "coreTime": "none",
            "obligations": "we have Zemi once a week, and we need to present the progress of research once in two weeks.",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "I worked on establishing interpretability of cooperative agents in multi-agent deep reinforcement learning system.",
            "topicSatisfication": 5,
            "atmosphere": "It's very comfortable, senpai and the professor are nicely kind and friendly.",
            "guidance": 1,
            "profCharacter": "He guides you a lot if you are very serious about the research. Otherwise, if you only need credits, he really doesn't take care of you.",
            "internationalStudents": "Bachelor 10, Master 16, Doctor 5",
            "jaRequired": "We have both Japanese zemi and English Zemi, so no worry about that.",
            "happiness": 5,
            "knowBeforeEnter": "Our lab is so good that I'm worried that too many students try to apply.",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/10/25 22:32:55",
            "theme": "Machine learning",
            "coreTime": "None",
            "obligations": "A English lab meeting and a Japanese lam meeting once a week",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Reinforcement learning for multi-agent systems",
            "topicSatisfication": 3,
            "atmosphere": "Everyone basically works individually but you can always discuss with senpais or the professor when you have questions",
            "guidance": 2,
            "profCharacter": "",
            "internationalStudents": "",
            "jaRequired": "You can definitely communicate with the professor in English and there’s also English lab meeting once a week",
            "happiness": 3,
            "knowBeforeEnter": "",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/10/21 19:59:25",
            "theme": "Machine learning",
            "coreTime": "None",
            "obligations": "A English lab meeting and a Japanese lam meeting once a week",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Reinforcement learning for multi-agent systems",
            "topicSatisfication": 3,
            "atmosphere": "Everyone basically works individually but you can always discuss with senpais or the professor when you have questions",
            "guidance": 2,
            "profCharacter": "",
            "internationalStudents": "",
            "jaRequired": "You can definitely communicate with the professor in English and there’s also English lab meeting once a week",
            "happiness": 3,
            "knowBeforeEnter": "",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Tatsuo Nakajima",
        "reviews": [
          {
            "t": "2021/03/20 16:27:41",
            "theme": "There is a lot of freedom when choosing what topic to research. Most people work on AR/VR applications. Some work on robotics related topics. The prof allows you to join other person's research if you are interested.",
            "coreTime": "Once a week there is a zemi on Monday 2nd and 3rd periods",
            "obligations": "Biweekly progress report/short summary of your progress by email.",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "I have joined someone else's robotics related research. I was mainly working with Unity",
            "topicSatisfication": 4,
            "atmosphere": "Since I joined during Covid-19, I rarely attended the class. The zemi is separated into two: English  zemi and Japanese zemi.",
            "guidance": 1,
            "profCharacter": "Very nice and understanding. He will guide and help you if you ask him.",
            "internationalStudents": "Not sure.",
            "jaRequired": "No, professor understands English.",
            "happiness": 4,
            "knowBeforeEnter": "A lot of independence, but you can also work with others if you cannot come up with a research question yourself.",
            "totalStudents": "I am not sure.",
            "enRequired": ""
          }
        ]
      }
    ],
    "Communications and Computer Engineering": [],
    "Intermedia Art and Science": [
      {
        "lab": "Ikuro Choh",
        "reviews": [
          {
            "t": "2020/10/22 14:27:37",
            "theme": "The Media Art Expressions Lab covered a variety of fields from holographic projections to service design and the scope of the lab included anything that pertained to providing a new approach into a visual media expression.",
            "coreTime": "Once a week, Thursdays 3rd, 4th periods",
            "obligations": "Weekly meetings at the lab, monthly presentations and progress updates, as well as sometimes other companies hold seminars to showcase products (e.g. SHARP Sony).",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "A new concept derived from how being in Tokyo kept you in the prying eyes of the public and artistic expression, my research was based around the idea of privacy, and I drafted a concept based on the owl and chameleon, where the owl cloak took the sound of your voice and generated an anti-wave to mimic active noise cancellation. The chameleon cloak took had cameras lining the cloak to allow the image of the region opposite the cloak to be shown",
            "topicSatisfication": 5,
            "atmosphere": "The other students in the lab were extremely welcoming to international students, and the professor occasionally holds pizza parties, the students are encouraged to socialise and be present and are given lots of time to critique each others' work.",
            "guidance": 2,
            "profCharacter": "",
            "internationalStudents": "Bachelor (0), Masters (3), Ph.D. (0)",
            "jaRequired": "Completely optional, as the professor let me present entirely in English.",
            "happiness": 5,
            "knowBeforeEnter": "This lab gave me a lot of freedom to experiment and come up with new concepts, but only out of my own passion did I actually have the motivation to work on the projects.",
            "totalStudents": "Bachelor (2), Masters (8), Ph.D. (2)",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Shigekazu Sakai",
        "reviews": [
          {
            "t": "2021/03/20 17:23:18",
            "theme": "My lab is focus on any research concerning with Computer Graphics and VFX in terms of design and concepts. Some of our research is also focused on multimedia entertainment or development such as game development or animation and design.",
            "coreTime": "Before covid, we have a weekly seminars every thursday from 5:30 pm but now with covid, it is now an online seminar every thursday from 1:30 pm. I try to attend all my lab seminars as much as possible.",
            "obligations": "Everytime during our Zemi, we report on our progress of our research project and our thesis. Then we discuss about our research and/or give presentations to inspire our juniors with deciding their research topic.",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "I am researching about a term called 世界観 (sekaikan). It directly translates to “World’s View”. This term is a very important concept in Japan for any creator (writers, directors, animators, game designers etc.) to understand how perspectives of your world that you created can affect how strong your game, book, movie etc. can be towards other people. As this term is important to many creators in Japan, I want to make a full thesis on this and show the international creators about this concept of 世界観 (World’s View)",
            "topicSatisfication": 5,
            "atmosphere": "Since there aren’t much international students in this lab, it would be very hard to communicate or make friends unless you can speak Japanese on a conversational level. There are 2 professors within this lab and the seminars are all in Japanese. Sometimes my professor would invite guest from media companies to give a presentations and inspire the students with their topics. Sometimes these guests may give opportunities for future jobs after graduation.",
            "guidance": 2,
            "profCharacter": "Yes, since my professor gives us a lot of independence for our research, it would be the best to ask questions, however big or small, to help with your research and he will give you a lot of insight and knowledge with your research topic and is very helpful. If I were to describe him with my own phrase, he is a very chill professor.",
            "internationalStudents": "Bachelor(3) Masters(1)",
            "jaRequired": "It is not required to know Japanese in my lab but I believe that it would be best to have a conversational level of Japanese to properly talk to other students or else it may be a bit difficult to communicate with them. All the professors in the lab can speak both English or Japanese so it won’t be a problem to talk to the professors as an international student.",
            "happiness": 4,
            "knowBeforeEnter": "- If you prefer to have your research topic fully guided by the professors (continuing the professor’s research, doing research based on what the professors asked you to do...etc.) then I don’t think this might be suitable for you since my professor gives more freedom to work on our research. \n- If you are someone who is interested in Computer graphic designs such as CGI, VFX, 3D/2D animation OR graphic designs concerning with AR/VR then this lab could be for you. \n- I would like to stress again for international students, although Japanese language is not required for the lab, it would be best to have a conversational level to properly communicate with everyone and get the most from this lab.",
            "totalStudents": "Bachelor(10-15) Masters(1-2)",
            "enRequired": ""
          },
          {
            "t": "2020/10/21 20:11:10",
            "theme": "Computer graphics",
            "coreTime": "Once a week, around 2 or 3 hours. The day and time could change for the semester depending on everyone’s schedules.",
            "obligations": "Weekly zemi",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "",
            "topicSatisfication": 3,
            "atmosphere": "Everyone was working individually, but we were encouraged to ask each other for help or advice on our research topics. The atmosphere is very casual and the professor is easy to talk to.",
            "guidance": 2,
            "profCharacter": "Professor is easy to talk to and will help if you have questions. He encourages everyone to pursue their individual interests.",
            "internationalStudents": "",
            "jaRequired": "You are not required to know Japanese, but discussions and communication with other students are usually in Japanese, so it would be helpful. The professor can communicate in English, so there shouldn’t be many issues if you don’t know Japanese.",
            "happiness": 4,
            "knowBeforeEnter": "",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      }
    ]
  },
  "CSE": {
    "Architecture": [],
    "Modern Mechanical Engineering": [
      {
        "lab": "Makoto Yoshida",
        "reviews": [
          {
            "t": "2020/10/20 19:00:51",
            "theme": "Our researches are mainly about the metal material engineering and metalworking. We utilize our strong connection with several major companies in automotive, aerospace, train, and power electronic module industries to develop less-defect and high-reliability future generation manufacturing process based on both numerical simulation and detailed experimental validation.",
            "coreTime": "None due to COVID. It depends on whether I have experiments to do.",
            "obligations": "For B3, we have weekly seminars lasting for 1 period. For engineering practice we don’t have it regularly instead we might go to some famous factories and manufacturers to do Kengaku (sometimes outside of Tokyo). While for B4 or above, monthly “research conference” is held for students to present what they have done during the last month and what has been discovered. Prof. Yoshida will be there to ask some questions for discussion. There might be some conferences that you’ll have to attend held by your joint research facilities.",
            "topicDecision": "The professor decided my topic for me",
            "yourResearch": "A joint research with Fuji Electric on the development of the low-temperature sintering technology for next generation power modules.",
            "topicSatisfication": 5,
            "atmosphere": "Japanese lab mates are really warm hearted and outgoing in our lab. They guided me patiently and kindly on the first several weeks. Doc. Khairi is an assistant prof who speaks good English and he is really kind to us. Senpai are surely easy to be reached to and professional of what they are researching. The atmosphere here is rather chill. But please note that we barely use English in the communications with Prof. Yoshida, the Senpai or lab mates from the same zemi. But anyways, international students are allowed to do presentations and our thesis in English.",
            "guidance": 4,
            "profCharacter": "Prof. Yoshida barely speaks English but he can clear things out for us insanely well in Japanese, he respects his students’ ideas very well and provides sufficient help on our research projects. I think he is easy to talk to if you speak some Japanese. And Doc. Khairi, the assistant prof who is guiding me through my thesis research, answers all of my questions well, detailed and in time. He is also very easy going and empathetic.",
            "internationalStudents": 2,
            "jaRequired": "Better to be able to speak Japanese for daily use but the thesis and presentations are absolutely OK to be finished in English.",
            "happiness": 5,
            "knowBeforeEnter": "The atmosphere of our lab is chill while the experiments are not. You can’t escape from doing heavy-industrial-like experiments. But that’s somehow cool, isn’t it?",
            "totalStudents": "B4 (9), Masters (about 25), Ph. D. (1). Cannot provide exact number because information on our website hasn’t been updated.",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Jun Ohya",
        "reviews": [
          {
            "t": "2020/10/20 20:44:23",
            "theme": "Computer vision",
            "coreTime": "4 hours a day, 4 days a week",
            "obligations": "nothing",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "Do simulation about UAV.",
            "topicSatisfication": 4,
            "atmosphere": "Mostly interact with international students",
            "guidance": 3,
            "profCharacter": "nice",
            "internationalStudents": "Bachelor (2), Masters (2), Ph.D. (1)",
            "jaRequired": "No",
            "happiness": 4,
            "knowBeforeEnter": "",
            "totalStudents": "Bachelor (28), Masters (20), Ph.D. (3)",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Hiroyuki Ishii",
        "reviews": [
          {
            "t": "2020/10/20 23:55:18",
            "theme": "Bio-inspired and adaptive robotics. Any other research topics of interest are also welcomed so quite flexible",
            "coreTime": "No true core time, flexible time.",
            "obligations": "Generally 2-3 periods of Zemi and EnPra per week from late 2nd year to end of 3rd year (3 semesters worth). EnPra group presentations about twice per semester and a final presentation of the robot we developed at the end of EnPra B. EnPra meetings are generally fortnightly or weekly (depending on progress). \n\nFinal year: Graduation thesis meetings can be fortnightly or weekly (depending on progress). Thesis presentation (research proposal and progress ppt) is generally twice per semester starting at Enpra C.",
            "topicDecision": "The professor gave a few topics to choose from but I ended up with my own different research topic (which thoe professor is also interested in)",
            "yourResearch": "Introducing another approach to sequential self-folding of a planar sheet to 3D origami. It is basically origami-inspired sheet robotics. My initial interest was modular robotics and it progressed to the current topic. My time was spent on reading related papers and designing prototypes plus experiments.",
            "topicSatisfication": 4,
            "atmosphere": "You work in teams during Enpra but individually for your graduation thesis. You can ask the senpais in the lab for guidance if needed. Everyone is friendly in my lab and some are fluent in English. Ishii lab is small as it is relatively new but it is comfortable, very flexible and the research topics are diverse. Professor Ishii is super nice, fluent in English and you can consult him if you have problems.",
            "guidance": 2,
            "profCharacter": "Super nice and friendly. Flexible. Easy to communicate with and easy to ask help/guidance from. Encouraging.",
            "internationalStudents": "4th year Bachelor (2), 3rd year Bachelor (1)",
            "jaRequired": "No Japanese is required for my lab. It is beneficial to be able to understand/speak Japanese as the seminars are in Japanese and for communication. However, everything else is in English or has English translations. No problem with communication with professor and some Japanese students.",
            "happiness": 5,
            "knowBeforeEnter": "It is best to decide on a research topic early and read as many papers as possible before presenting your proposal. You also need to search and purchase your materials yourself (you do get refunded). Take classes that can be helpful for your research topic. Be ready to be independent as you will be doing everything from designing prototypes to experiments mostly yourself (you may ask for guidance when needed)",
            "totalStudents": "I'm not sure of the numbers but generally at least 16 in the lab (including international and Japanese students from Bachelors to Ph.D)",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Yu Matsuda",
        "reviews": [
          {
            "t": "2020/10/24 21:13:52",
            "theme": "Kind of varies, but mostly related to core physics",
            "coreTime": "None. ~2,3 times at the moment, will go more often from December",
            "obligations": "Weekly seminar as a 3rd year",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Collision physics. Building on previous research which consisted of experiments wherein a gel ball was dropped on a sand bed and the resulting physical phenomena were analysed",
            "topicSatisfication": 3,
            "atmosphere": "Our lab is small and I'm the only international student, but the atmosphere is very relaxed and I get on with the seniors and we chat regularly with the professor (about academics and general things)",
            "guidance": 4,
            "profCharacter": "He's very easy to talk to and quite supportive",
            "internationalStudents": "Bachelor (1, me)",
            "jaRequired": "No, but it's always easier to communicate with the students in Japanese. My professor always emails me in English, but face-to-face we talk in Japanese. Research-wise, Japanese is not a must.",
            "happiness": 4,
            "knowBeforeEnter": "I do wish I'd had a deeper understanding about the research topics of the lab",
            "totalStudents": "Bachelor (12), Masters (3), Ph.D. (0)",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Hiroshi Onoda",
        "reviews": [
          {
            "t": "2021/05/14 2:41:50",
            "theme": "Ultra-Light Weight Vehicles (EV), Biomass, Life Cycle Assessment",
            "coreTime": "None",
            "obligations": "Once a week Zemi, presentation twice per semester",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "Renewable System Integration in Unelectrified Areas to Aid ULV Development",
            "topicSatisfication": 5,
            "atmosphere": "Pretty comfortable and the professor is open to discussions anytime. There is only one professor looking over everyones’ research, but he also offer internship opportunities while doing your research.",
            "guidance": 2,
            "profCharacter": "Easily approchable. Will help guide your research according to what you want to do.",
            "internationalStudents": "50%",
            "jaRequired": "English is fine, but gradually they would expect you to learn Japanese for further use",
            "happiness": 5,
            "knowBeforeEnter": "",
            "totalStudents": "Approx. 3B, 25M, 4D",
            "enRequired": ""
          }
        ]
      }
    ],
    "Industrial and Management Systems Engineering": [],
    "Civil and Environmental Engineering": [
      {
        "lab": "Hideo Komine",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Geotechnical engineering",
            "coreTime": "before COVID: Komine sensei's general rule is to be in the lab 10am-5pm, but it's flexible if you have part-time job, etc. Personally the 10am-5pm schedule works for me since it helps me from slacking, and if I start working in a company I would need to be working for longer hours anyways. Helps build a habit I guess. and since I only had 1-3 classes in a sem for 4th year, research is what I put most of my time in aside from job-hunting. Not exactly expected to be there strictly between 10am-5pm, you can come in after lunch and then leave later, etc. or anything that suits your schedule, but it's good that the professors know that you are working on something for your research consistently. For the first few months you need to conduct basic soil experiments that are related to your topic. Meetings with everyone in the lab are held every 2 weeks in the morning to report our plans for the next two weeks. after COVID: During the campus closure, lunch meetings were held on zoom every weekday from 12:15 for about 15-30mins to hear announcements from the professor and report our plans for the day. Since we couldn't do experiments (which constitutes most of the research done in this lab), we spent most of our time reading papers and creating figures",
            "obligations": "・Read papers\n ・do basic soil experiments (which are mandatory for the first few months until your 1st, 2nd presentation in the lab\n ・Do your own experiments for your own research\n ・process data from those experiments\n ・Prepare for lab presentations by creating ppt and handout (as needed)",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "I study the thermal properties (thermal conductivity and heat capacity) of soils by doing experiments. This is for investigating whether soil would be a useful material for heat storage, and be a sustainable energy source. It's a relatively new topic within the lab, but there is one master student who also does experiments for soil thermal property so we work together with different samples.",
            "topicSatisfication": "",
            "atmosphere": "Everyone tends to mind their own business but is supportive if you ask. It takes a while to get used to the atmosphere and build relationships with the students since your the only undergrad international student. Better to learn who you can ask help from early on to make it easier for you afterwards.",
            "guidance": "",
            "profCharacter": "Very helpful, as long as you ask for it. \n ①Komine sensei: the main professor who loves academic discussion, and will try to find time to chat with students about research. He also has a lot of connections in the construction field and can introduce you to sempais or people in many companies from the field, so listening to his experiences is also nice if you are considering a career in civil eng in Japan. His English is a bit hard to understand so I just use Japanese to communicate with him.\n \n ②Wang sensei: international professor who is supportive in your thesis plan and research. He is probably the only professor who you can discuss about research in straight english. He is very helpful in adjusting your research plan as you progress in it.\n \n ③Goto sensei: a professor from Tokyo university who you only really interact with during presentations, who gives good feedback on data presentation, interpretation, etc.\n \n ④Ito sensei: a doctorate student who is an assistant professor, supportive of other students with experiments and other parts of research\n \n Komine lab has more professors compared to other labs, so you'll be able to receive relatively more expert advice if you reach out in my opinion",
            "internationalStudents": "Bachelor (1 person→myself at the moment), Masters (2people, one M1 and one M2), Ph. D. (1 person)",
            "jaRequired": "Doesn't require you to speak/write/read in Japanese. Wang sensei is able to translate the Japanese to English when available, and Komine sensei does his best to communicate with you in English. You can also join lab meetings and speak in English, everyone else speaks in japanese though. However, speaking and reading in Japanese would be very useful because there are opportunities to interact with OBOG and civil companies in Japan frequently, and many papers that the professors recommend you to read are in Japanese.",
            "happiness": "",
            "knowBeforeEnter": "It was difficult to grasp the job-hunting schedule in Japan and figure out how to balance it with research but for sure, the earlier the better!",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Hirokazu Akagi",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Soil mechanics",
            "coreTime": "None",
            "obligations": "Holding bi-weekly meetings with the head professor (presentations and reports) and hold weekly meetings with the assistant professor. Depending on what project you’re given, you’re expected to spend at least 3 days per week in the laboratory.",
            "topicDecision": "The professor decided my topic for me",
            "yourResearch": "My bachelor thesis research mainly covered the effects of loose soil/ sandy soils over non-circular tunnel linings. Through simulations and miniature-model experiments, I was able to visualize and contextualize the behavior of sandy soils over non circular tunnel linings.",
            "topicSatisfication": "",
            "atmosphere": "I worked mainly with an international grad student on the same thesis project assigned. In other words, most of the laboratory tests conducted were jointly done in a group of two. Japanese students working in the same laboratory were open and offered a lot of great insight on how to use some of the experimental apparatuses and software. \n The laboratory holds one head professor and an assistant PhD student that oversees and guides your progress. If you need any questions or help the assistant PhD student is more than happy to help.",
            "guidance": "",
            "profCharacter": "Both the Professor and assistant mentor are willing to answer any question involving writing reports, lab issues, etc. I’d say the professor and mentor provides a lot of support on the direction of your research. Professor Akagi provides great insight and guides the flow of your thesis schedule. The assistant PhD student will oversee most of the development of your thesis schedule and tests. Both the professor and PhD students are more than eager to provide support and guidance on your thesis.",
            "internationalStudents": "Masters (1) PhD (1)",
            "jaRequired": "The research lab does not require you to have perfect fluency in Japanese (Lab meetings will be held in English), but a general understanding of Japanese definitely benefits (reading Japanese-written reports, software etc).",
            "happiness": "",
            "knowBeforeEnter": "I’d most likely advise students to be ready to brush-up on computer programming (my lab used FORTRAN-based simulation software written by a grad student in the lab)",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Kiyoshi Ono",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Steel structures",
            "coreTime": "3-5 times a week, core time is Monday",
            "obligations": "Progression check with professor (weekly), Zemi meeting (once a month),",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "The research I conducted for my thesis was compression test of steel columns made of new high performance steel. It was experiment focused, so I spent most of the time investigating the experimental data and researching why the data behaved like that.",
            "topicSatisfication": "",
            "atmosphere": "The lab atmosphere is chill, and professor Ono unexpectedly likes cute things (like sumikkogurashi), so it’s also fun. Japanese is strongly required to communicate with the Japanese students. You work with a few (depends on the topics) other people who share the same or similar topics with you. You can always consult with senpais, so it’s easy to get help.",
            "guidance": "",
            "profCharacter": "100% supportive. He gives you detailed instructions of what to do, but also expecting self-research. He’s always in the lab so you can find him easily.",
            "internationalStudents": "Masters (3 people)",
            "jaRequired": "It is optional but definitely preferred to speak Japanese. Communication in English is common with professor, but sometimes important information exchange are done between the students, so Japanese is required in a sense. It is better to read papers in Japanese as well to produce better understanding.",
            "happiness": "",
            "knowBeforeEnter": "None (I’m satisfied)",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Steel structures",
            "coreTime": "Minimum 3 times a week (13:00~18:00) of your choice. Monday is mandatory because there is Zemi.",
            "obligations": "There is Zemi once a week on Mondays (13:00~) usually for around 20 minutes or so where Ono sensei goes over the schedule for the next month so everybody is up to date on what they should be doing. You should avoid taking classes or making plans without consulting Ono sensei during this period.\n \n You have to submit a report a few times a month to Ono sensei about your progress with your research and what you have been doing.",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "I worked with stainless steel. We want to use this material more in construction, but there is still a lot that we don't know yet about its material properties, like its residual stresses. Residual stresses are stresses in the material that are generated as a result of the manufacturing process, and it is known to lower the steel's performance. To get the residual stress distributions, we actually need to cut the steel specimens with a handsaw, and measure the strains before and after cutting.\n \n Another one I worked with was SBHS (a new type of high performance steel). We don't really know too much about how much load it can carrying, so we make several specimens out of SBHS and do compression tests.",
            "topicSatisfication": "",
            "atmosphere": "Mostly quiet while everyone is working, but when the right people are around and the professor isn't in the lab, it usually gets pretty lively! The Japanese students are very accepting of the international students, but they would be even more accepting if you can speak even a little bit of Japanese (like beginner level). Research happens in teams and are usually divided up by the type of steel material, but you have your own experiments.",
            "guidance": "",
            "profCharacter": "If there is something you don't understand about your thesis and you ask, he will answer. But you obviously need to do your own part and do some research beforehand. Students are expected to figure out a lot of these things by relying on others in the lab and reading other journals, so I think it's a really good practice to build research skills!",
            "internationalStudents": "Masters (2 people), Ph.D. (0 people)",
            "jaRequired": "You are required to know 0 Japanese. The professor will communicate with you in English, and every part of your research is done in English. However, if you want to communicate with your professor or lab mates even more, it may be helpful to know a bit of Japanese. Also, you can do your research reading only English journals, but it would certainly be an extra advantage to be able to read Japanese journals.",
            "happiness": "",
            "knowBeforeEnter": "If there is a specific type of research topic that you want to do, VISIT THE PROFESSOR. The research topics we do in the lab are usually related to collaborative research projects with other universities and companies, so if there is a very specific research topic you want to study, it may not always be possible (depends on the year). Meet the professor beforehand, tell him what you are interested in, and try to negotiate a solution. I had a very scary image of Ono sensei before entering the lab, but once you join the lab you will see that he is very nice and understanding.",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Kuniaki Sasaki",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Urban planning",
            "coreTime": "3times a week from 2nd period to 4th period",
            "obligations": "Weekly reports and monthly presentations",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "Pursuing the Characteristics of Expressway Users During the Obon Holidays",
            "topicSatisfication": "",
            "atmosphere": "People are nice. Around 5 international students. Free-atmosphere with no specific rules",
            "guidance": "",
            "profCharacter": "He would be helpful if you ask him what to do but this is the difficult part",
            "internationalStudents": "Masters 1 person, PhD 2 person",
            "jaRequired": "Nope",
            "happiness": "",
            "knowBeforeEnter": "It is the best to talk with the senpai so if you want to know more, please contact me.",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Masato Sekine",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "River engineering",
            "coreTime": "None, went for 2-6 hours depending on the day",
            "obligations": "weekly zemi, semi-weekly meetings",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "analysis and simulation using softwares",
            "topicSatisfication": "",
            "atmosphere": "I was the only international student so it was a bit difficult to get along with the Japanese students. I was in a group of students with similar research topics and we often discussed research together. The lab rooms was quiet during the day, and lively in evenings.",
            "guidance": "",
            "profCharacter": "Sekine sensei is really helpful and nice, but very busy at times",
            "internationalStudents": "-",
            "jaRequired": "Yes. Sekine sensei can speak/understand English but he prefers to communicate in Japanese. I had to read previous senpai's papers which are all in Japanese",
            "happiness": "",
            "knowBeforeEnter": "none",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Mitsuyoshi Akiyama",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Concrete engineering",
            "coreTime": "technically \"none\", but it's kind of an unspoken rule that you have to come at least 4x a week.",
            "obligations": "zemi is held 2 weeks once. even though the professor and senpais do not check on you, you have to do your work and present progress in your zemi.",
            "topicDecision": "The professor decided my topic for me",
            "yourResearch": "i did analysis on debris estimation due to earthquake&tsunami from structures. Mine was done completely with programs, so program proficiency is needed and a lot of theory reading. Other teams(will descrie later) researches are more experiment-oriented. The whole lab often uses FEM for concrete modelling.",
            "topicSatisfication": "",
            "atmosphere": "Akiyama Lab is one of the biggest labs (in numbers). Our lab is divided to 2 major groups, and Khem is like the 'mentor' for 1 group, and one more japanese senpai the other mentor. We have 2 lab rooms so you'll be close to only half of the members.\n You will be asked to choose a research topic group, and you will work with them. Currently there are:\n - Multi-hazard group(my group)\n - Pre-cast concrete\n - Fiber Steel reinforcement\n - Damper (Earthquake analysis)\n - Corrosion (automizing corrosion detection; AI)\n - earthquake-resistant bridge design\n \n labmates are very friendly and helpful, but you would have to try to figure out things on your own since everyone is quite busy (esp. spring semester when everyone is trying to finish their thesis). So, better learn as much as you can before november :p I would say this lab has a lot of majime people, but they're really fun as well!",
            "guidance": "",
            "profCharacter": "My mentor is basically my senpai because my thesis is very similar to whwat he was doing. They're really helpful, but it depends on the type of person. One of my mentors preferred to give hints and asked me to resolve my problems on my own, but the other was really helpful to teach me.\n \n My professor is a very understanding person, but he asks for progress and hardwork from each students. He is very caring about appearances and formats (for presentations, zemi, thesis). You will be let free to do whatever in lab, but don't let that make you think you're FREE. He is very kind and responds to students but at the same time strict. He expects excellence from his students. He rarely gets mad but you don't want him to scold you (:\n \n Since I'm not on Khem-san's team, I didnt get a chance to work a lot with him. But i've seen him care of other's student's thesis, so I think if you work with him you are in good hands.",
            "internationalStudents": "masters - 3 \n phD - 2\n Sopokhem Lim - 1 and only",
            "jaRequired": "My professor worked overseas so hhe's proficient in english. I had no intl students senpai when i joined my team (multi-hazard), so I had to communicate in Japanese with my senpai to ask. Papers that I read are in english, but it would bbe very helpful if you can read japanese too.\n \n Teams that has more international students uses english as their main language.",
            "happiness": "",
            "knowBeforeEnter": "Sometimes I thought it's better to choose other teams which has more international students; because I've not been best at communicating esp. in Japanese. The lab expects you to do your work and be independent, so I think it's a good representation of how Japanese work culture would be (if any of you is thinking of doing shuukatsu). \n \n Oh and people in this lab likes to drink! :D",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Motoi Iwanami",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Tunnel engineering",
            "coreTime": "None. About 3 times a week.",
            "obligations": "Monthly presentations.",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "analytically confirm the waterproof performance of general RC segment joints and sealing materials used in Japan and overseas.",
            "topicSatisfication": "",
            "atmosphere": "everything is good",
            "guidance": "",
            "profCharacter": "whenever I faced the problem, I could always receive the unfailing supports and comments from him.",
            "internationalStudents": "Masters (3 people)",
            "jaRequired": "Sensei cannot speak English, so you have to know Japanese.",
            "happiness": "",
            "knowBeforeEnter": "Welcome if you are interested in Structure or Tunnel.",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Yo Sasaki",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Landscape design",
            "coreTime": "About twice a week, two to three periods",
            "obligations": "Zemi starts from every Wednesday 6th period; recently, every Monday has a short meeting",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "I chose the place I was interested, after reading lots of papers and researches, then I did interview.",
            "topicSatisfication": "",
            "atmosphere": "The atmosphere is fine, because most of time, students do work individually so not too much contact with other students. Lab is the place for work, treating other students as colleagues will make you feel good.",
            "guidance": "",
            "profCharacter": "Prof. Sasaki is very willing to answer your questions. If you have anything want to know, you can contact with her by Slack. But notice, before asking her, be sure you have do the research and cannot find the answer.",
            "internationalStudents": "B4-1(Japanese course), M1-2(1 International course, 1 Japanese course), M2-1(International course), D1-1(International course)",
            "jaRequired": "I recommend you can speak Japanese. It will be easier for you to paticipate and really enjoy the Zemi. Usually Japanese students can speak little English, so if you can only speak English, it will be hard to discuss with other students. Also, enjoy the chance you can speak and do the presentations in Japanese! As long as you are not a native Japanese speaker, Zemi could be a really good place for you to train your Japanese and no one will laugh at you.",
            "happiness": "",
            "knowBeforeEnter": "It's fine. :D",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Landscape design",
            "coreTime": "Usually two times a week, once for around 5 hours in afternoon. However it is totally fine to be absent, nobody really keep an eye on me so I go only when I need.",
            "obligations": "Zemi for once a week on Wednesday night, but you only have to present your stuff for once in two or three weeks. This semester we have online meeting on Monday morning for around an hour since we no longer meet regularly in the lab.",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "Mine is research about residents’ feeling toward the Okubo area under the ethnic tourism context, questionnaire investigation is the main body of my research. Our lab usually requires frequent field work(except for this year due to COVID-19). You need to know a bit about GIS. Also familiar with excel. If you know SPSS it would be very helpful. Some people would use space syntax for their research but I choose not to since I don’t know about it. Our lab is quite closed to social science though.",
            "topicSatisfication": "",
            "atmosphere": "Relaxed??we have one professor only and she is busy, if she is in the office it is an separated room. We basically talk freely. You do your own stuff but you could consult senpai anytime or arrange a meeting with professor personally. Senpais are nice but they are not good in English.",
            "guidance": "",
            "profCharacter": "She is very helpful and kind as long as you ask, Her English is totally fine for academic conversation(of course if you speak Japanese it would be better).but if you don’t ask she barely talks to you, so try to find her actively if you want to meet the schedule.",
            "internationalStudents": "2 masters and 1 bachelor (all Chinese though",
            "jaRequired": "Yes. The research itself requires you to know about Japanese, at least for speaking, listening and reading. Writing is less important. Professor’s English is totally fine, but students are not.",
            "happiness": "",
            "knowBeforeEnter": "I feel like our lab is almost perfect for people don’t like math and good with Japanese. we do final presentation in early august. All urban labs share the same schedule.",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Yutaka Sakakibara",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Environmental engineering",
            "coreTime": "None",
            "obligations": "Zemi once a week on Wednesdays (around 2-monthly presentation)",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Water denitrification on site (experiment) near Honjo-waseda campus.",
            "topicSatisfication": "",
            "atmosphere": "They were all really friendly and could mostly speak English so I had no trouble bonding with them.",
            "guidance": "",
            "profCharacter": "Pretty much. Sakakibara先生 speaks quite good English.",
            "internationalStudents": "-",
            "jaRequired": "Not a single Japanese is used for my research, but it helped me bond with the other students that didn’t speak English that well.",
            "happiness": "",
            "knowBeforeEnter": "I’d wished to know that I’d needed to go to Honjo-waseda almost every other week to get the samples.\n But you can change the topic of your thesis if you care to discuss, I guess.",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Environmental engineering",
            "coreTime": "10am-3pm weekdays. not in practice now due to covid-19",
            "obligations": "zemi once a week, monthly presentations on research progress.",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "phytoremediation of heavy metals",
            "topicSatisfication": "",
            "atmosphere": "laid back. good balance between international and japanese students, but interaction is limited if you dont speak japanese. generally work in groups of 2-3.",
            "guidance": "",
            "profCharacter": "he will offer support if you need it.",
            "internationalStudents": "bachelors (1), masters (4), doctorate (1)",
            "jaRequired": "no",
            "happiness": "",
            "knowBeforeEnter": "research funding is limited, so dont expect to be able to buy and use a lot of fancy hi-tech equipment.",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Environmental engineering",
            "coreTime": "none ， at least 2- 3 days",
            "obligations": "zemi 2h per week",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "Help to deal with problems in reality. using biochar to fix heavy metal in soil. experiment",
            "topicSatisfication": "",
            "atmosphere": "freedom, but have to show your attitude of study, individual, not that lively. only one professor",
            "guidance": "",
            "profCharacter": "yes they help it. yes. generous and humor",
            "internationalStudents": 3,
            "jaRequired": "know better than unknown not necessary",
            "happiness": "",
            "knowBeforeEnter": "reconsider again whether u will not feel regret to choose such a lab which is not helpful for you to find a job. if you have already determined what u wanna do after graduation, welcome to Sakakibara s lab",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Environmental engineering",
            "coreTime": "None, before the start of the experiment I try to show up in the office instead whenever I have the time",
            "obligations": "Weekly zemi, monthly presentation",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "My original thesis topic was on the Remediation of Persistent Organic Pollutants (POPs) in Soil via Biochar Application which is an experiment, but since I didn't have any results before the school closure in April, I changed the topic to the Biochar and Its Application in Soil, which is mainly literature review. POPs are compounds that are not biodegradable so it accumulates in the environment and organism when consumed, thus it can go up the food chain. They're mainly found in soils of developing countries as they were used in the past but the usages are currently banned in multiple countries due to the health effects. Biochar is a material that can adsorp various pollutants, and its made of organic biomass (manure, agricultural waste etc) which undergo thermal decomposition so it's easily accessible.\n In the experiment, I germinated oats seeds in fresh soil and then moved them to contaminated POP soil. I set aside soil samples in 2 days intervals for a week, used soxhlet extractor to extract the PCP from soil and analyze the amount left in soil using GC-ECD machine.",
            "topicSatisfication": "",
            "atmosphere": "I can only speak for my experience until April 2020. Unless you can speak a certain level of Japanese, there wasn't much interaction between me and Japanese students (the other international students in the lab spoke a decent amount of Japanese, which is not my case and therefore they had more interaction). I was originally assigned under a Japanese senior, who was doing similar research topic, but he never spoke any English and I was lucky enough that the professor passed by the lab just before the discussion so he stayed and helped with translation and explained to the Japanese senior about my research, which helped a lot. Then one of the international student senior offered to be my supervisor instead since I just couldn't communicate with the Japanese senior, so I worked with him and received guidance on the necessary information I need about the lab (the passwords, what I need to do, where things were located in the lab room etc) until I began my experiment and slowly asked for help from the Japanese seniors as I needed to conduct similar experiment to what they had done previously.",
            "guidance": "",
            "profCharacter": "The professor would occasionally check on me in the office when he had time but apart from that it was pretty independent. We also had some discussions every now and then. He is more of a result oriented person, so he wouldn't interfere until the results is out (or during monthly presentations) and thats when he would give advice on improvements that could be done.",
            "internationalStudents": "Masters (2 people), Ph.D (2 people; I'm not sure if one of them is still in Ph.D or have graduated)",
            "jaRequired": "The professor has no problem communicating in English. He speaks good English, and tries to motivate the Japanese members to speak English as well but the Japanese members mainly doesn't speak English. The research itself doesn't require Japanese skills at all but when inquiring to the Japanese seniors, you have to know Japanese to ask questions.",
            "happiness": "",
            "knowBeforeEnter": "The other international students would try to help you as much as they can but otherwise it's pretty independent.\n \n I had decided the general topic in Early October but since our curriculum only had 2 environmental engineering courses, which are taught by Prof. Sakakibara himself, he understood that my knowledge on the topic is very limited so he had me read papers for the first month. The Japanese senior advised me to watch videos in relation to the experiments, which were all in Japanese so I had to translate those myself to understand and the whole process went on for a few months. (which probably took longer because of the amount of classes that I had to take and my Japanese skills.)\n I began my first experiment in February, which didn't produce good results so when I was redoing it under the guidance of my Japanese senior, the school was closed which I was just left wandering. In Mid-May, we decided on a new thesis topic and I began writing until Thesis Submission to prof in mid-July and the final submission+Thesis Defense in Late July",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Yasuhiko Sato",
        "reviews": [
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Concrete engineering",
            "coreTime": "Must attend seminar (Friday 15:00-17:00) but no core time. I went 3days per week 3hrs each. Meeting about your research once a week or two weeks.",
            "obligations": "Translate some design guide textbooks (like ACI) into Japanese and explain to the lab",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Reformulating previous design shear strength equation for RC beam using FRP bars, into simpler form\n Investigated, and used FEM analysis",
            "topicSatisfication": "",
            "atmosphere": "The lab is cozy, the room is clean and nice. We work individually but the Japanese students are very friendly and they help each other a lot. Have Mac laptop for each members!",
            "guidance": "",
            "profCharacter": "Sato sensei helps a lot but only when you ask for it. He is nice and kind.",
            "internationalStudents": "1 masters (Chinese girl)",
            "jaRequired": "I did most of my work in Japanese. Might be good if you are fluent in Japanese but Sato sensei can speak English.",
            "happiness": "",
            "knowBeforeEnter": "Super nice lab! I’ll be working as part time job in the lab until spring so would be able to support with international student issues :)",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Akinori Morimoto",
        "reviews": [
          {
            "t": "2021/08/03 14:00:44",
            "theme": "City and transport planning. Driverless cars, transit oriented development, smart cities, light rail, etc.",
            "coreTime": "Mon-Fri 10:30-5:00 usually but less because of COVID. They're not that strict and don't keep track of core time so it's possible to go less than that. I go around 3 times a week.",
            "obligations": "Weekly seminars where we present progress",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "For my thesis i studied sharing in the city. The first half of my thesis consists of a literature review of the sharing economy which is set to be published and the second half consists of looking at how different governments around the world went about implementing sharing in the city and its results.",
            "topicSatisfication": 4,
            "atmosphere": "Everyone is very friendly. Because of covid a lot of the events were canceled but since that's almost over there should be mamy opportunities to connect with the Japanese students. The Professor likes to conduct wine seminars where he teaches us about wine while we drink.",
            "guidance": 3,
            "profCharacter": "Professor Morimoto is quite hands off since he is quite busy but Professor Kitano will help with more detailed advice and guidance. They are both very nice and are in the lab almost every day to talk to students.",
            "internationalStudents": "Bachelor (1)Masters(6)PHD(1)",
            "jaRequired": "No Japanese necessary",
            "happiness": 5,
            "knowBeforeEnter": "This lab has a lot of focus on coding and statistics. While it's not necessary to know before joining (i didn't) , it would probably help. This laboratory is quite good since the professor is well connected. If you work hard you can get good results and most of our undergrads get published in papers or conferences.",
            "totalStudents": "~30",
            "enRequired": ""
          },
          {
            "t": "2021/03/20 22:55:55",
            "theme": "City and transport planning. Topics within transport planning includes micromobility, light rail, traffic safety, driverless cars, carsharing etc. Topics within city planning includes the sharing city. While there's no one doing it right now international development is also a topic you can do.",
            "coreTime": "You're supposed to come everyday from 10-5 unless you have class or other obligations but they're not very strict about it.",
            "obligations": "Weekly progress meeting/ presentation",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Im researching the effectiveness of government policies in the implementation of a smart sharing city, which is a city that uses ICT and sharing to create a more sustainable environment. Since it's a newly proposed city model, there's a lot of interesting things that can be researched!",
            "topicSatisfication": 5,
            "atmosphere": "Everyone is very nice and there are many opportunities to interact with the Japanese students.",
            "guidance": 3,
            "profCharacter": "Professor Morimoto is quite hands-off and busy so its sometimes difficult to understand what he wants you to do but Professor Kitano is very helpful and can help give more specific instructions and guidance.",
            "internationalStudents": "Bachelor (1), Masters (6), phd (1)",
            "jaRequired": "No Japanese needed",
            "happiness": 5,
            "knowBeforeEnter": "For this lab we don't really do much engineering. Its mostly statistics and/or coding for city and transport planning. But you don't need to know much when you start.",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Transport planning",
            "coreTime": "We generally do have a 10:30 -17:00 Core time during weekdays (Excluding Holidays). However, it is not like they keep logs so it is relatively flexible.",
            "obligations": "Usually we have thesis, analysis and statistics seminar per week(Three in total). We have to prepare a powerpoint every week for thesis seminar to show progress, and for analysis and statistics seminar, you may need to present, but it is usually a rotation among students taking the seminar. You can get credits for the seminars.\n *This may change based on number of students, lab schedule etc.",
            "topicDecision": "Combination of 2 and 3. For my personal case, it was 2), as I had an idea of what I wanted to do, but considering all of the other international students we had in the past, they are mostly the mixture of 2-3. It is basically discussion based, but it would be better if you are in line with the lab's theme since it is easier for you to get data.",
            "yourResearch": "For suburban cities, vacant homes are an issue as they can cause city function to decrease, decrease in attractiveness, and so on. However, we are unable to predict nor understand the distribution of vacant homes in a macro sense as usually vacant homes are investigated manually by knocking on door to door. This is usually very time consuming, and costly as it takes a lot of man power. \n \n From this, I suggested a projection model to estimate the future distribution of vacant homes. Here, I used GIS software to tabulate geographical data, and used water work data for the distribution of vacant homes.",
            "topicSatisfication": "",
            "atmosphere": "We are expected to do our own research individually. However, we are usually divided into teams (transportation, city planning team, and then we are then divided into smaller divisions). Within the division, we usually share ideas, talk about what we can do, and so on. As for international students, we do not have a lot of us, so we are also like a team. \n \n As for the interaction between Japanese students, it really depends on the year. Usually, everyone is approachable, and the professor also likes talking to students. We frequently have Nomikai, and In that sense, we do have a very friendly atmosphere, so we do try to talk to each other frequently. \n \n We do have an assistant called Kitano sensei, and he has a separate room, and he will also look over you.",
            "guidance": "",
            "profCharacter": "They both provided me more independence. For my case both Kitano sensei and Morimoto sensei was very approachable and advised when I asked questions, or when I seemed to be off track/missing a point during seminars. They respected me and usually provided support if I had questions. So they did not spoon feed me answers, but advised accordingly when I needed them. I would say they were both helpful and approachable when I needed them. \n \n However, I have also seen cases where the teachers gave more support, over independence, as there are standards each student needs to meet. This really depends!",
            "internationalStudents": "-",
            "jaRequired": "No Japanese requirements. However, it would be better if you can speak as it will allow you to talk to people, read senpai's past thesis, and so on. Kitano sensei and Morimoto sensei will conduct seminars in English, so not too worry about that too much.",
            "happiness": "",
            "knowBeforeEnter": "Positive: \n Everyone is approachable, and we generally have a fun environment. I used to go diner, drinking, and so on with my lab mates. I love Professor Morimoto, and I still try to help out if I can. Always happy to go back to say hi! \n The lab environment and atmosphere is very positive, constructive and fun in general.\n \n Negative: \n I suppose the research standard is pretty high? you do have to build your argument constructively, and will have to make a good thesis at the end. You will also have to write a 100 pg thesis at the end, so it may sound very demanding. You do have to have ownership, and spend enough time, and effort for your thesis. You do have one year so it is not all too bad in my opinion, but you do have to work! It is not a lab you can just lay down, and graduate. I have also seen people that were unable to graduate in the past from our lab.",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Tomoya Shibayama",
        "reviews": [
          {
            "t": "2021/08/03 14:16:47",
    
            "theme": "Mainly focus on tsunami, typhoon, etc.",
            "coreTime": "None. I go to the lab only when I need to.",
            "obligations": "We have weekly meetings and monthly progress report.",
        
            "topicSatisfication": 5,
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "My bachelor thesis topic is modeling tsunami hazard from Manila Trench to the southeast coastline of China. I did research on Manila Trench and simulated the tsunamis.",
        
            "guidance": 3,
            "happiness": 5,
            "atmosphere": "All the members and professors are very kind. Usually you have one professor who you will have meeting with every week, but you still can get advice from other professors and doctors.",
            "profCharacter": "Professor Shibayama and Professor Esteban are all very kind. Professor Esteban is very easy to talk with, you can consult anything with him.",
            
            "totalStudents": "I'm not sure..maybe over 20+ Students in total.",
            "internationalStudents": "Bachelor(2),masters(3?),PhD (3+?)",
            
            "jaRequired": "No. We have our meeting and progress report all in English.",
            "enRequired": "",
        
            "knowBeforeEnter": "It would be a great help if you know a little about how to use computer well, like programing, coding, etc."    
          },
          {
            "t": "2021/03/20 14:40:34",
            "theme": "Shibayama Lab mainly focuses on coastal engineering, such as tsunamis, landslides, and other natural disasters like earthquakes and typhoons.",
            "coreTime": "Due to COVID-19, we only have monthly presentation days. Besides, you have to have a meeting with your constructor every week.",
            "obligations": "Weekly meetings and monthly presentations.",
            "topicSatisfication": 5,
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "My research is around the tsunami hazard of Manila trench towards Xiamen area. Professor Esteban told me a lot about Manila trench, since I am Chinese, Professor told me that talking about tsunami hazards and China, I can search about Manila trench. Then Professor Takabatake taught me a lot about how to simulate a tsunami using program. I'm still working with the simulation.",
            "guidance": 4,
            "happiness": 5,
            "atmosphere": "There are many international students and Professors in our Lab. The monthly presentations are all in English. Due to COVID-19 I haven't meet with any Japanese students yet... But all the professors are very nice and you can consult with them freely.",
            "profCharacter": "They are all very nice and easy to talk to.",
            "totalStudents": "I am not quite sure about it... But each time we have over 25 members in the monthly presentation Zoom.",
            "internationalStudents": "Bachelor (2), Masters (3?), Ph.D. (3?)",
            "jaRequired": "No. The monthly presentations are in English",
            "enRequired": "",
            "knowBeforeEnter": "I am not good at computer and programing, but for simulations, it's better if you can use programing. So I am still learning about it."
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Coastal engineering",
            "coreTime": "No core time",
            "obligations": "Weekly individual consultation with the professor/assistant professor, and monthly progress report with all lab members",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "My research was about understanding the evacuation behavior and tsunami awareness of local residents after the 2018 Sunda Strait Tsunami. I collected surveys and conducted evacuation planning simulations.",
            "topicSatisfication": "",
            "atmosphere": "To communicate with the other Japanese lab members, you don't need to speak Japanese perfectly. BUT, you do need to do your part of the fair share and try approaching them. If you don't try to talk to them, then they may feel intimidated. If you can try to approach them, they’re more than happy to be your friend and also invite you to nomikais!",
            "guidance": "",
            "profCharacter": "Very helpful! I went to Professor Shibayama for consultant for general questions, but my main mentor was the assistant professor (Professor Takabatake). I went to him for detailed questions about my research and was very helpful and nice!",
            "internationalStudents": "3phd 3masters",
            "jaRequired": "No Japanese required for the research, and the professor speaks English very well.",
            "happiness": "",
            "knowBeforeEnter": "Look into if there are any assistant professors in the lab. If there are any, they might be your mentor instead of the professor.\n \n Also, you need to have good time management skills. The lab has a very chill vibe and everyone is very laid back, but people still get their work done properly. Although there are weekly consultations to keep you on track, because there is no core time, you need to manage your own time to get things done on time. On the other hand, the advantage is that you can do your research at your own pace and it also gives you time to do other things like internships and job-hunting, etc.",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Coastal engineering",
            "coreTime": "None, 3-4 times",
            "obligations": "Weekly individual consultation and monthly progress report",
            "topicDecision": "The professor decided my topic for me",
            "yourResearch": "My research is based on wave characteristics during Typhoon passage. It was numerical simulation based. You will be dealing with a lot of programs and it takes some time to explore them and get used to it.",
            "topicSatisfication": "",
            "atmosphere": "You work more closely with people who share similar topic as you. Most of the time you do as an individual (after you get used to things) Since we have no fixed schedule, the people you meet is really depending on time (and luck?)",
            "guidance": "",
            "profCharacter": "My mentor is very helpful and very supportive. However, you need to learn to ask the right questions. That is, you know what you are doing and you did your study in order to get the most out of your consultation sessions.",
            "internationalStudents": "3phd 3masters",
            "jaRequired": "Optional. (Unless you want to talk more with your japanese lab mates, then some japanese would be helpful)",
            "happiness": "",
            "knowBeforeEnter": "Visit lab to know how are things like before you make up your mind; and now that the situation is different due to covid, it will be different compared to what we experienced earlier",
            "totalStudents": "",
            "enRequired": ""
          },
          {
            "t": "2020/08/03 10:40:45",
            "theme": "Coastal engineering",
            "coreTime": "None. I usually go to the lab at least twice a week.",
            "obligations": "We have weekly meetings and monthly progress report. Students should make a presentation in the progress report and it starts from 13:00 (usually Tuesday). The progress report often takes hours and ends at around 17:00 or 18:00. You can still take classes as long as you can show up and talk about your progress before the meeting ends.",
            "topicDecision": "The professor would give you several topics to choose from. But for my case, I decided my own topic. It mainly depends on how many students are doing similar topics as the one you want to do.",
            "yourResearch": "I did a sensitivity test of WRF. Simply speaking, WRF is a simulation software to simulate the weather (typhoon, weather forecast ...), volcano ash, and some other atmospheric simulations. The sensitivity test I did was to compare the accuracy and the changes of the simulation results by using different physics settings (the theories or equations used to calculate atmospheric changes).",
            "topicSatisfication": "",
            "atmosphere": "Basically everyone works on their own research. You might have one or two senpai teaching you how to perform simulations and research. But since we don't have core time and undergraduate students are usually not in the lab, the chance of communicating with other students is pretty limited. The instructor you would be talking to is decided by Professor Shibayama after you decide your research topic.",
            "guidance": "",
            "profCharacter": "My instructor is Professor Esteban (in Shibayama lab). He would give me suggestions when needed and papers that he thinks would be helpful to me. Other instructors might also give you suggestions during progress reports.",
            "internationalStudents": "Masters (3 people), Ph.D. (3 people), post doctor (1 person)",
            "jaRequired": "No. Including progress report, all of the students are required to use English in the lab. Most of the Japanese students can communicate in English, but it would be really helpful if you can speak Japanese.",
            "happiness": "",
            "knowBeforeEnter": "None.",
            "totalStudents": "",
            "enRequired": ""
          }
        ]
      }
    ],
    "Resources and Environmental Engineering": []
  },
  "ASE": {
    "Physics": [
      {
        "lab": "Hideyuki Sawada",
        "reviews": [
          {
            "t": "2021/03/20 16:34:38",
            "theme": "The research lab mainly focuses on robotics, machine learning, SMA (shape memory alloys) and research on oil drops",
            "coreTime": "None. I usually go to the lab everyday but because of corona, I have been working from home unless I require lab equipments.",
            "obligations": "Weekly lab meetings on Wednesdays, and progress seminars once every 2 weeks",
            "topicDecision": "I did most of the research to decide my topic and the professor guided/mentored me",
            "yourResearch": "My research topic is on soft robotics. I am building a biomimetic jellyfish robot inspired by origami to help with deep water exploration.",
            "topicSatisfication": 5,
            "atmosphere": "Everyone is very friendly and helpful. There are also a few international students so I use both English and Japanese to talk to other students in the lab. \n\nWe work individually because the research topic is very different, but the seniors are more than happy to help us if we are unsure about certain things.\n\nThe lab has 3 different research labs. The main research lab is in building 55, but depending on your research topic, you may be asked to work in the robotics lab (main campus) or the chemistry lab (nishi waseda campus).",
            "guidance": 1,
            "profCharacter": "He is very friendly and open-minded. He constantly gives me assistance during the progress seminars if I need any support. However, please keep in mind that his lab requires constant progress report so it is not for those who want “easy” credits.",
            "internationalStudents": "About 5",
            "jaRequired": "No. He encourages Japanese students to use English.",
            "happiness": 5,
            "knowBeforeEnter": "",
            "totalStudents": "About 24. There are some students who do not go to Masters but most of them do.",
            "enRequired": ""
          }
        ]
      }
    ],
    "Applied Physics": [],
    "Chemistry and Biochemistry": [
      {
        "lab": "Yasuhiko Terada",
        "reviews": [
          {
            "t": "2020/10/21 11:45:36",
            "theme": "Molecular cell biology. We work with cells, proteins and DNA.",
            "coreTime": "Before COVID-19: Monday to Friday 10-19, Saturday 10-17. During COVID-19: Flex time",
            "obligations": "Journal Club: Fridays (Present once a semester), Progress Report: Saturdays (Present once a month)",
            "topicDecision": "The professor decided my topic for me",
            "yourResearch": "My research is to determine the molecular mechanism of a certain protein that functions to maintain a rigid structure of the centrosome during mitosis. I worked with cancer cell and observed the cells during mitosis.",
            "topicSatisfication": 5,
            "atmosphere": "The laboratory is mostly filled with Japanese students, so we mainly speak in Japanese. We have few international students, but knowing Japanese is kinda required. We have team topics but work individually. The atmosphere is nice, where everyone is friendly.",
            "guidance": 3,
            "profCharacter": "Likes to talk and have discussion but hard to catch him.",
            "internationalStudents": "Masters (2), Ph.D. (1)",
            "jaRequired": "You can survive without not knowing Japanese but is very recommended to know daily conversation level Japanese. You can do presentations in English and talk to the professor in English, but many laboratory equipments and daily conversations are in Japanese.",
            "happiness": 5,
            "knowBeforeEnter": "You should go check all laboratories that you are interested in!",
            "totalStudents": "Bachelor (3), Masters (6), Ph.D. (1)",
            "enRequired": ""
          }
        ]
      }
    ],
    "Applied Chemistry": [
      {
        "lab": "Suguru Noda",
        "reviews": [
          {
            "t": "2020/10/23 7:54:34",
            "theme": "Carbon nanotubes, hydrogen, batteries, solar cells",
            "coreTime": "Mon-Fri 10:00-17:00 (before COVID-19)",
            "obligations": "1. Weekly Group Discussions (progress report)\n2. Weekly seminars (compulsory attendance)\n3. Two seminars per semester (as presenter)\n4. Daily experiments, data analysis, sample organization etc (because of core time)",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Title: Energy efficient hydrogen production via ammonia thermolysis over a hot Ni catalyst\n\nThermally decomposed ammonia to produce H2 over a nickel catalyst. The H2 is to be used in vehicular fuel cells as an alternative to gasoline, in order to reduce greenhouse emissions. In my bachelor’s thesis, I focused on optimizing the decomposition process by varying several experimental parameters and investigating different catalyst structures.",
            "topicSatisfication": 4,
            "atmosphere": "Very friendly, and people are extremely helpful. We work individually because everyone’s topic is different, but people with similar topics are put into groups (CNT, H2, Batteries etc), so if you have any questions or need help, you can ask your group members. But the research itself is done on an individual basis. \nThe lab rooms are pretty busy at all times - there will always be at least one person in any room at any given time at any day of the week. \nMy lab does have two professors, but Professor Noda is the head professor so you can always consult with him regardless of the nature of your question. Professor Hanada is in charge of the H2 group, so if you’re part of that, you can also consult with her.",
            "guidance": 3,
            "profCharacter": "Extremely helpful and will give you constructive feedback during your weekly presentations.",
            "internationalStudents": "Two as of now (both M2). We had ~6-7 but they graduated in September.",
            "jaRequired": "No. The Professor encourages everyone to communicate in English. But it’ll help if you can speak Japanese as you’ll be able to talk to other members better and ask for help/just have a good lab life.",
            "happiness": 4,
            "knowBeforeEnter": "Core time is quite annoying. Even if you don’t have work to do, you’ve to come to lab (a long commute for me) every single day. Apart from that, everything has been really good. The workload gets quite busy so there won’t be many days where you have nothing to do anyway. \n\nThe best thing about the lab is definitely the professors. They’re extremely helpful and very good at what they do, and can speak English, so you won’t feel like anything’s lacking.",
            "totalStudents": "Around 45. Just 1 PhD student as of now, and the rest are evenly divided between B4, M1 and M2.",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Kenji Yasuda",
        "reviews": [
          {
            "t": "2021/03/22 15:51:37",
            "theme": "In the lab, we deal with various types of cells, such as cardiomyocites, neural cells, phagocytes, and cancer cells. Exploiting the combination of latest microfabrication technologies and measurement technologies, we regulate the temporal aspect and spatial distribution of the cells of interest to investigate the change dynamical behaviors in response to the constraints at a cellular level to analyze the epigenetic information innate to cells.",
            "coreTime": "none, I go to lab 4 times a week from around 11:00 to 17:00",
            "obligations": "2 Zemi per week (a progress report with everyone, and one with your group). Annual meeting of the Biophysical Society of Japan during summer for which you will have to prepare a poster for.",
            "topicDecision": "The professor gave me a few topics to chose from",
            "yourResearch": "Unlike single cells that exhibit random-walk like fashion, collective cell migration involves various mechanochemical signaling across the junctions to invoke a migration that resembles an active soft matter. Large-scale flow of a multicellular assembly is observed in plethora of physiological developments, such as, wound healing, tissue morphogenesis, tumor metastasis, and embryonic developments. Using microfabrication technology, I construct geometrical constraints that regulate cell locomotion during culture to identify the various phenotypic properties of the cells and attempt to model the cellular dynamics.",
            "topicSatisfication": 3,
            "atmosphere": "There aren't international students in Yasuda lab other than myself but the atmosphere is friendly and students help each other when in need. We work in groups depending on the type of cell you are dealing with (i.e. cardial cells, neural cells, phagocytes, or epithelial cells). How active the student is in lab strongly depends on that student's motivation.",
            "guidance": 3,
            "profCharacter": "The professor is easy to talk to and will give insights on your research. In general he is friendly and caring. Sometimes he will ask questions whether you understand your topic so it is recommended that you make sure that you are on the same page as your professor.",
            "internationalStudents": "Masters(1)",
            "jaRequired": "It is recommended that you know Japanese to communicate with other students. I communicate in Japanese with my professor, but he can communicate in English as well.",
            "happiness": 4,
            "knowBeforeEnter": "The contract with other staff people ended last year so it is only the students and the professor. While the research area is in the fields of Biophysics, the experiments involves dealing with cells so it may feel like you are in Biology.",
            "totalStudents": "Bachelor (6), Masters (10)",
            "enRequired": ""
          }
        ]
      },
      {
        "lab": "Junichiro Yamaguchi",
        "reviews": [
          {
            "t": "2021/07/17 17:39:59",
            "theme": "Organic Chemistry, mainly in new reaction/catalyst development.",
            "coreTime": "No\" core time but required to be in 6 days a week, 8am to about 9pm",
            "obligations": "Weekly reports, monthly reports, fortnightly homework, paper presentation with 1h long Q&A (only done in Japanese). Weekly meetings comprise presentation of homework and paper presentations. Monthly meetings are for the progress reports of chosen students. Each student has to submit one blog post every 3 months or they will not receive credits for that semester.",
            "topicDecision": "The professor decided my topic for me",
            "yourResearch": "Synthesis of organic compounds as part of collaborative research for pesticide drug recovery. The company I work with chooses what they want me to make and I just have to synthesize it for them.",
            "topicSatisfication": 1,
            "atmosphere": "Many Japanese students will avoid interaction if they're not sure that you understand them. Experimental procedures and knowledge is not taught by the professors so you have to ask a senior to teach you. Everyone has to be in lab so the lab is always filled with students. \n\nHolidays are not a given. There are no public holidays or school holidays in this lab. There are approximately 30 days of given holidays excluding Sundays. These holidays can be deducted if one is late for lab or does not meet the work expectations. Professors have high expectations of students and do use profanities on students when mistakes are made. When late, severe punishments are dealt on top of holidays being deducted and being severely scolded.\n\nEvents are a big part of this lab. Participation is compulsory. The attendance for only the first round of drinking sessions is compulsory but not staying all the way until the third or fourth round will result in the professors providing less support.",
            "guidance": 1,
            "profCharacter": "He does not actually care about students in the English program.",
            "internationalStudents": "Bachelor (1 + 1 in Japanese program), Masters (1 in Japanese Program), Ph.D.  (0)",
            "jaRequired": "Everything is conducted in Japanese. Professors and very few seniors can speak and provide guidance in English but everything is done in Japanese. Joining the lab without knowing how to speak/write/read Japanese will result in having to learn it while working on experiments.",
            "happiness": 1,
            "knowBeforeEnter": "Working hours and workload. This lab is extremely exhausting. Sundays are \"rest days\" but reports have to be written.\n\nAttitude of professor. He does not care about anything he is not interested in. He is not interested in students who do not choose to pursue Ph.D. with the research topics that he comes up with. He is extremely biased towards those he is interested in.\n\nRules and restrictions. There are so many of them that most students are not able to have a life outside of lab.",
            "totalStudents": "Bachelor (8), Masters (15), Ph,D, (8)",
            "enRequired": ""
          }
        ]
      }
    ],
    "Life Science and Medical Bioscience": [],
    "Electrical Engineering and Bioscience": []
  }
}